import sqlite3

# Виконати запит з файлу
def execute_query(file_name):
    try:
        with open(file_name, 'r') as query_file:
            sql = query_file.read()

        conn = sqlite3.connect('university.db')
        cursor = conn.cursor()
        cursor.execute(sql)

        result = cursor.fetchall()
        return result

    except sqlite3.Error as e:
        print(f"Помилка бази даних: {e}")

def choos_query():
    while True:
        print('Запити до бази даних:\n',
        '1.Знайти 5 студентів із найбільшим середнім балом з усіх предметів.\n',
        '2.Знайти студента із найвищим середнім балом з певного предмета.\n',
        '3.Знайти середній бал у групах з певного предмета.\n',
        '4.Знайти середній бал на потоці (по всій таблиці оцінок).\n',
        '5.Знайти які курси читає певний викладач.\n',
        '6.Знайти список студентів у певній групі.\n',
        '7.Знайти оцінки студентів у окремій групі з певного предмета.\n',
        '8.Знайти середній бал, який ставить певний викладач зі своїх предметів.\n',
        '9.Знайти список курсів, які відвідує студент.\n',
        '10.Список курсів, які певному студенту читає певний викладач.\n',
        '11.Середній бал, який певний викладач ставить певному студентові.\n',
        '12.Оцінки студентів у певній групі з певного предмета на останньому занятті.\n')
        
        num = input('Введіть номер запиту або "Enter" для виходу >> ')
        if not num:
            break
        query_file = f'query_{num}.sql'
        result = execute_query(query_file)
        print(f"Результат запиту {num}:")
        for row in result:
            print(row)
        input('\nВведіть "Enter" для продовження')

if __name__ == "__main__":
    choos_query()




